# Nurbs Surface Data Get Weight Method

Source: https://www.revitapidocs.com/2026/7dfeae66-3fc4-08b1-a00f-4f1eb8317d69.htm

---

| Nurbs Surface Data Get Weight Method |
| --- |

Get the weight.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetWeight(
	int idx
)
```

```
Public Function GetWeight (
	idx As Integer
) As Double
```

```
public:
double GetWeight(
	int idx
)
```

```
member GetWeight :
        idx : int -> float
```

#### Parameters

idx Int32
:   The index of the weight.

#### Return Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Out\-of\-range access. |

See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace